; domain
(define (domain signs)
    
    (:requirements :typing :action-costs)

    (:types buffer workplace board shape color)

    (:predicates
        (expert-mode)
        (advanced-mode)

        (in-hand-board ?board - board )
        (in-hand-saw)
        (in-hand-paint)
        (hand-free)
	    
        (at ?x - board ?y - buffer)
        (mounted ?x - board ?y - workplace)
        (empty ?x - workplace)
        
        (cuted ?x - board )
        (has-shape ?x - board ?y - shape)

        (painted ?x - board )
        (has-color ?x - board ?y - color)
    )

    (:functions
        (total-cost)
    )

    (:action pick
        :parameters ( ?board - board ?place - buffer)
        :precondition (and (hand-free) (at ?board ?place))
        :effect (and
            (in-hand-board ?board)
            (not (hand-free))
            (not (at ?board ?place)) ) )

    (:action grasp-saw
        :parameters ()
        :precondition (and (hand-free))
        :effect (and
            (in-hand-saw)
            (not (hand-free))
            (increase (total-cost) 1) ) )

    (:action grasp-paint
        :parameters ()
        :precondition (and (hand-free))
        :effect (and
            (in-hand-paint)
            (not (hand-free))
            (increase (total-cost) 1) ) )

    (:action stash
        :parameters ( ?board - board ?place - buffer)
        :precondition (and (in-hand-board ?board))
        :effect (and
            (not (in-hand-board ?board))
            (hand-free)
            (at ?board ?place) ) )

     (:action do-saw
        :parameters ( ?board - board ?place - workplace ?shape - shape)
        :precondition (and
            (in-hand-saw)
            (mounted ?board ?place)
            (not (cuted ?board)))
        :effect (and
            (cuted ?board)
            (has-shape ?board ?shape)
            (increase (total-cost) 8)) )

     (:action do-paint
        :parameters ( ?board - board ?place - workplace ?color - color)
        :precondition (and
            (in-hand-paint)
            (mounted ?board ?place)
            (cuted ?board)
            (not (painted ?board)))
        :effect (and
            (painted ?board)
            (has-color ?board ?color)
            (increase (total-cost) 12)) )


    (:action drop-saw
        :parameters ()
        :precondition (and (in-hand-saw))
        :effect (and
            (not (in-hand-saw))
            (hand-free)
            (increase (total-cost) 1) ) )

    (:action drop-paint
        :parameters ()
        :precondition (and (in-hand-paint))
        :effect (and
            (not (in-hand-paint))
            (hand-free)
            (increase (total-cost) 1) ) )

    (:action mount
        :parameters ( ?board - board ?place - workplace)
        :precondition (and (in-hand-board ?board) (empty ?place) )
        :effect (and
            (not (in-hand-board ?board))
            (hand-free)
            (mounted ?board ?place)
            (not (empty ?place))
            (increase (total-cost) 4) ) )

    (:action umount
        :parameters ( ?board - board ?place - workplace)
        :precondition (and (hand-free) (mounted ?board ?place) )
        :effect (and
            (in-hand-board ?board)
            (not (hand-free))
            (not (mounted ?board ?place))
            (empty ?place)
            (increase (total-cost) 4) ) )

    (:action switch-advanced
        :parameters ()
        :precondition (and (not (advanced-mode)) (not (expert-mode)))
        :effect (and
            (advanced-mode)
            (increase (total-cost) 15)
        )
    )

    (:action switch-expert
        :parameters ()
        :precondition (and (advanced-mode) (not (expert-mode)))
        :effect (and
            (not (advanced-mode))
            (expert-mode)
            (increase (total-cost) 22)
        )
    )

)

; problem
(define (problem big-problem4)
    (:domain signs)
    (:objects
        buff - buffer
        place1 place2 - workplace
        trigon circle square - shape
        blue yellow red green - color
        board0 board1 board2 board3 board4 - board
    )
    (:init
        (empty place1)
        (empty place2)
        (hand-free)
        (= (total-cost) 0)

        (at board0 buff)
        (at board1 buff)
        (at board2 buff)
        (at board3 buff)
        (at board4 buff)
    )
    (:goal
        (and
            (at board0 buff)
            (at board1 buff)
            (at board2 buff)
            (at board3 buff)
            (at board4 buff)

            (has-color board0 blue)
            (has-color board1 red)
            (has-color board2 blue)
            (has-color board3 blue)
            (has-color board4 blue)

            (has-shape board0 circle)
            (has-shape board1 trigon)
            (has-shape board2 square)
            (has-shape board3 circle)
            (has-shape board4 circle)
        )
    )
    (:metric minimize (total-cost))
)

; plan
1. (pick board2 buff)
   deleted: (hand-free) (at board2 buff)
   added: (in-hand-board board2)
   goals met: 4 of 15
2. (mount board2 place1)
   deleted: (in-hand-board board2) (empty place1)
   added: (hand-free) (mounted board2 place1)
   goals met: 4 of 15
3. (pick board3 buff)
   deleted: (hand-free) (at board3 buff)
   added: (in-hand-board board3)
   goals met: 3 of 15
4. (mount board3 place2)
   deleted: (in-hand-board board3) (empty place2)
   added: (hand-free) (mounted board3 place2)
   goals met: 3 of 15
5. (grasp-saw)
   deleted: (hand-free)
   added: (in-hand-saw)
   goals met: 3 of 15
6. (do-saw board2 place1 square)
   added: (cuted board2) (has-shape board2 square)
   goals met: 4 of 15
7. (do-saw board3 place2 circle)
   added: (cuted board3) (has-shape board3 circle)
   goals met: 5 of 15
8. (drop-saw)
   deleted: (in-hand-saw)
   added: (hand-free)
   goals met: 5 of 15
9. (grasp-paint)
   deleted: (hand-free)
   added: (in-hand-paint)
   goals met: 5 of 15
10. (do-paint board3 place2 blue)
   added: (painted board3) (has-color board3 blue)
   goals met: 6 of 15
11. (do-paint board2 place1 blue)
   added: (painted board2) (has-color board2 blue)
   goals met: 7 of 15
12. (drop-paint)
   deleted: (in-hand-paint)
   added: (hand-free)
   goals met: 7 of 15
13. (umount board3 place2)
   deleted: (hand-free) (mounted board3 place2)
   added: (in-hand-board board3) (empty place2)
   goals met: 7 of 15
14. (stash board3 buff)
   deleted: (in-hand-board board3)
   added: (hand-free) (at board3 buff)
   goals met: 8 of 15
15. (pick board0 buff)
   deleted: (hand-free) (at board0 buff)
   added: (in-hand-board board0)
   goals met: 7 of 15
16. (mount board0 place2)
   deleted: (in-hand-board board0) (empty place2)
   added: (hand-free) (mounted board0 place2)
   goals met: 7 of 15
17. (umount board2 place1)
   deleted: (hand-free) (mounted board2 place1)
   added: (in-hand-board board2) (empty place1)
   goals met: 7 of 15
18. (stash board2 buff)
   deleted: (in-hand-board board2)
   added: (hand-free) (at board2 buff)
   goals met: 8 of 15
19. (grasp-saw)
   deleted: (hand-free)
   added: (in-hand-saw)
   goals met: 8 of 15
20. (do-saw board0 place2 circle)
   added: (cuted board0) (has-shape board0 circle)
   goals met: 9 of 15
21. (drop-saw)
   deleted: (in-hand-saw)
   added: (hand-free)
   goals met: 9 of 15
22. (grasp-paint)
   deleted: (hand-free)
   added: (in-hand-paint)
   goals met: 9 of 15
23. (do-paint board0 place2 blue)
   added: (painted board0) (has-color board0 blue)
   goals met: 10 of 15
24. (drop-paint)
   deleted: (in-hand-paint)
   added: (hand-free)
   goals met: 10 of 15
25. (pick board1 buff)
   deleted: (hand-free) (at board1 buff)
   added: (in-hand-board board1)
   goals met: 9 of 15
26. (mount board1 place1)
   deleted: (in-hand-board board1) (empty place1)
   added: (hand-free) (mounted board1 place1)
   goals met: 9 of 15
27. (umount board0 place2)
   deleted: (hand-free) (mounted board0 place2)
   added: (in-hand-board board0) (empty place2)
   goals met: 9 of 15
28. (stash board0 buff)
   deleted: (in-hand-board board0)
   added: (hand-free) (at board0 buff)
   goals met: 10 of 15
29. (pick board4 buff)
   deleted: (hand-free) (at board4 buff)
   added: (in-hand-board board4)
   goals met: 9 of 15
30. (mount board4 place2)
   deleted: (in-hand-board board4) (empty place2)
   added: (hand-free) (mounted board4 place2)
   goals met: 9 of 15
31. (grasp-saw)
   deleted: (hand-free)
   added: (in-hand-saw)
   goals met: 9 of 15
32. (do-saw board4 place2 circle)
   added: (cuted board4) (has-shape board4 circle)
   goals met: 10 of 15
33. (do-saw board1 place1 trigon)
   added: (cuted board1) (has-shape board1 trigon)
   goals met: 11 of 15
34. (drop-saw)
   deleted: (in-hand-saw)
   added: (hand-free)
   goals met: 11 of 15
35. (grasp-paint)
   deleted: (hand-free)
   added: (in-hand-paint)
   goals met: 11 of 15
36. (do-paint board4 place2 blue)
   added: (painted board4) (has-color board4 blue)
   goals met: 12 of 15
37. (do-paint board1 place1 red)
   added: (painted board1) (has-color board1 red)
   goals met: 13 of 15
38. (drop-paint)
   deleted: (in-hand-paint)
   added: (hand-free)
   goals met: 13 of 15
39. (umount board4 place2)
   deleted: (hand-free) (mounted board4 place2)
   added: (in-hand-board board4) (empty place2)
   goals met: 13 of 15
40. (stash board4 buff)
   deleted: (in-hand-board board4)
   added: (hand-free) (at board4 buff)
   goals met: 14 of 15
41. (umount board1 place1)
   deleted: (hand-free) (mounted board1 place1)
   added: (in-hand-board board1) (empty place1)
   goals met: 14 of 15
42. (stash board1 buff)
   deleted: (in-hand-board board1)
   added: (hand-free) (at board1 buff)
   goals met: 15 of 15
